print("\nДве строки можно" + "сцепить с помощью оператора \"+\". ")

print('\nЭта строка ' + "вряд ли " + "удив" + "ит вас. " \
      + "Но интересно. " + "что" + " она - \n" + "одна длинная-длин" \
      "на" + "я" + " строка, сцепленная " \
      + "из" + " двадцати двух\n" + "отдельных строк, разбитых " \
      + "на шесть строк. " + "Достаточно ли вы" + " впечатлены?" + "Ну хватит.\n" \
      + "Вот" + " наша" + " длинная" + " строка и закончилась!")
print("\nЕсли текст нравиться его можно и повторить. К примеру,")
print("кто не любит пироженых? Только дураки не любят пироженых. А")
print("Раз мы люди честные. То выскажимся о своих симпатиях")
print("откровенно")
print("Пироженые" * 10)
if __name__ == "__main__":
    input("\n\nНажмите Enter чтобы выйти. ")