#Классическая игра виселица
import random

#констааты
HANGMEN = (
    '''
     _________
     |       |
     |       |
     |           
     |    
     |    
     |   
     |       
     |    
     |    
     |    
     |
   __|_____________
         
    ''',
    '''
     _________
     |       |
     |       |
     |      [_]        
     |       
     |    
     |   
     |      
     | 
     |   
     |    
     |
   __|_____________
   
    ''',
    '''
     _________
     |       |
     |       |
     |      [_]        
     |       |
     |         \\
     |          |
     |        
     |     
     |        
     |       
     |
   __|_____________
   
    ''',
    '''
     _________
     |       |
     |       |
     |      [_]        
     |       |
     |      -+-\\
     |          |
     |       
     |     
     |     
     |     
     |
   __|_____________
   
    ''',
    '''
     _________
     |       |
     |       |
     |      [_]        
     |       |
     |     /-+-\\
     |    |     |
     |       
     |     
     |     
     |    
     |
   __|_____________
   
    ''',
    '''
     _________
     |       |
     |       |
     |      [_]        
     |       |
     |     /-+-\\
     |    |  |  |
     |       |
     |      -+-
     |        
     |      
     |
   __|_____________
   
    ''',
    '''
     _________
     |       |
     |       |
     |      [_]        
     |       |
     |     /-+-\\
     |    |  |  |
     |       |
     |     /-+-
     |     |   
     |     |   
     |
   __|_____________
   
    ''',
    '''
     _________
     |       |
     |       |
     |      [_]        
     |       |
     |     /-+-\\
     |    |  |  |
     |       |
     |     /-+-\\
     |     |   |
     |     |   |
     |
   __|_____________
   
    '''
)
MAX_WRONG = len(HANGMEN) - 1
WORDS = ('пастораль', 'компьютер', 'антенна', "подсказка", "случайность", "контейнер")

TIPS = ("Поэтизированное название мирной и простой сельской жизни и таких же пейзажей",
        "Сложное устрйство для взаимодействия с информацией",
        "Нечто для улучшенного взаимодействия с сигналом",
        "Информация для облехченого решения проблемы",
        "Непрогнозируруемое событие",
        "Объект для хрпнения")
word = random.choice(WORDS) # Слово для отгадывания
indexes = WORDS.index(word)
TIPS_ANSVER = TIPS[indexes]
so_far = '-' * len(word)
wrong = 0
used = [] # Буквы которые игрок уже предлагал
choice = ''
counters = 0

print("Добро пожаловать в игру \"Виселица\". Удачи вам.")

while wrong < MAX_WRONG and so_far != word:
    print(HANGMEN[wrong])
    if wrong == MAX_WRONG - 1 and counters == 0:
        print('\nЕсли вы хотите подсказку введите: да\nДля пропуска введите любой другой вариант.')
        choice = input("Введите ваш выбор: ")
        if choice.lower() == "да":
            print(TIPS_ANSVER, '\n')
            counters += 1
        else:
            counters += 1

    print(f'\nВы уже предлагали следуещие буквы:\n{used}')
    print(f'\nОтгаданнон слово сечас выглядит так:\n{so_far}')
    guess = input('\n\nВведите, предпологаемую вами, букву: ')
    while len(guess) != 1:
        print("Введите только одну букву!")
        guess = input("Выбранная вами буква: ")
    guess = guess.lower()
    while guess in used:
        print(f'Вы уже предлогали букву {guess}')
        guess = input('\n\nВведите букву: ')
        guess = guess.lower()
    used.append(guess)
    if guess in word:
        print(f'\nДа! Буква {guess} есть в словаре!')
        new = ''
        for i in range(len(word)):
            if guess == word[i]:
                new += guess
            else:
                new += so_far[i]
        so_far = new
    else:
        print(f'\nК сожалению, буевы {guess} нет в слове')
        wrong += 1

if wrong == MAX_WRONG:
    print(HANGMEN[wrong])

    print('\nВас повесили!')
else:
    print('\nВы отгадали!')

print(f'\nБыло загаданно слово {word}')


if __name__ == "__main__":
    input("\n\nНажмите Enter чтобы выйти. ")
